In [4]:
!pip install mysql-connector-python

Looking in indexes: https://pypi.org/simple, https://pypi.ngc.nvidia.com
Requirement already satisfied: mysql-connector-python in c:\users\engsm\miniconda3\lib\site-packages (9.1.0)

In [2]:
import mysql.connector

# Replace with your actual MySQL connection details
conn = mysql.connector.connect(
    host='localhost',
    user='root',
    password='root',
    database='mysql'
)
cursor = conn.cursor()

In [3]:
# list all tables in the database
cursor.reset()
cursor.execute("SHOW TABLES")

# Fetch all results
tables = cursor.fetchall()
for table in tables:
    print(table)

('columns_priv',)
('component',)
('db',)
('default_roles',)
('engine_cost',)
('func',)
('general_log',)
('global_grants',)
('gtid_executed',)
('help_category',)
('help_keyword',)
('help_relation',)
('help_topic',)
('innodb_index_stats',)
('innodb_table_stats',)
('ndb_binlog_index',)
('password_history',)
('plugin',)
('procs_priv',)
('proxies_priv',)
('replication_asynchronous_connection_failover',)
('replication_asynchronous_connection_failover_managed',)
('replication_group_configuration_version',)
('replication_group_member_actions',)
('role_edges',)
('server_cost',)
('servers',)
('slave_master_info',)
('slave_relay_log_info',)
('slave_worker_info',)
('slow_log',)
('tables_priv',)
('time_zone',)
('time_zone_leap_second',)
('time_zone_name',)
('time_zone_transition',)
('time_zone_transition_type',)
('user',)

# DDL
- CREATE
- DROP
- ALTER
- TRUNCATE

In [5]:
cursor.execute("CREATE DATABASE IF NOT EXISTS debi3")

In [6]:
cursor.execute("SHOW DATABASES")
print(cursor.fetchall())

[('debi',), ('debi3',), ('debi_2',), ('information_schema',), ('mydatabase',), ('mysql',), ('performance_schema',), ('sys',)]

In [7]:
cursor.execute("USE debi3")

In [8]:
# create a new table
cursor.execute("CREATE TABLE IF NOT EXISTS Employee (id INT, name VARCHAR(255), age INT)")

In [10]:
cursor.execute("SHOW TABLES")
# Fetch all results
tables = cursor.fetchall()
for table in tables:
    print(table)

('employee',)

In [11]:
# check the table schema
cursor.execute("DESCRIBE Employee")
schema = cursor.fetchall()
for column in schema:
    print(column)

('id', 'int', 'YES', '', None, '')
('name', 'varchar(255)', 'YES', '', None, '')
('age', 'int', 'YES', '', None, '')

In [12]:
# Drop the table if needed
cursor.execute("DROP TABLE IF EXISTS Employee")
cursor.execute("SHOW TABLES")
tables = cursor.fetchall()
for table in tables:
    print(table)

In [13]:
# create a new table
cursor.execute("CREATE TABLE IF NOT EXISTS Employee (id INT, name VARCHAR(255), age INT)")

In [14]:
cursor.execute("DESCRIBE Employee")
schema = cursor.fetchall()
for column in schema:
    print(column)

('id', 'int', 'YES', '', None, '')
('name', 'varchar(255)', 'YES', '', None, '')
('age', 'int', 'YES', '', None, '')

In [15]:
# Alter some columns
cursor.execute("ALTER TABLE Employee MODIFY COLUMN name varchar(100) NOT NULL")
cursor.execute("ALTER TABLE Employee ADD COLUMN salary DECIMAL(10, 2)")

# Check the schema again
cursor.execute("DESCRIBE Employee")
schema = cursor.fetchall()
for column in schema:
    print(column)

('id', 'int', 'YES', '', None, '')
('name', 'varchar(100)', 'NO', '', None, '')
('age', 'int', 'YES', '', None, '')
('salary', 'decimal(10,2)', 'YES', '', None, '')

In [16]:
# Truncate the table
cursor.execute("TRUNCATE TABLE Employee")

# DML 
- INSERT
- UPDATE
- DELETE

In [17]:
cursor.execute("INSERT INTO Employee (id, name, age) VALUES (1, 'John Doe', 30)")

# check the inserted data
cursor.execute("SELECT * FROM Employee")
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'John Doe', 30, None)

In [19]:
# insert multiple rows
data = [
    (2, 'Jane Smith', 25),
    (3, 'Alice Johnson', 28),
    (4, 'Bob Brown', 35)
]

cursor.executemany("INSERT INTO Employee (id, name, age) VALUES (%s, %s, %s)", data)

# check the inserted data
cursor.execute("SELECT * FROM Employee")
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'John Doe', 30, None)
(2, 'Jane Smith', 25, None)
(3, 'Alice Johnson', 28, None)
(4, 'Bob Brown', 35, None)

In [20]:
# UPDATE some records
cursor.execute("UPDATE Employee SET salary = 5000 WHERE id = 1")

# check the updated data
cursor.execute("SELECT * FROM Employee")
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'John Doe', 30, Decimal('5000.00'))
(2, 'Jane Smith', 25, None)
(3, 'Alice Johnson', 28, None)
(4, 'Bob Brown', 35, None)

In [21]:
# UPDATE some records
cursor.execute("UPDATE Employee SET salary = 3000 WHERE age < 30")

# check the updated data
cursor.execute("SELECT * FROM Employee")
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'John Doe', 30, Decimal('5000.00'))
(2, 'Jane Smith', 25, Decimal('3000.00'))
(3, 'Alice Johnson', 28, Decimal('3000.00'))
(4, 'Bob Brown', 35, None)

In [22]:
# Delete some records
cursor.execute("DELETE FROM Employee WHERE id = 1")
# check the remaining data
cursor.execute("SELECT * FROM Employee")
rows = cursor.fetchall()
for row in rows:
    print(row)

(2, 'Jane Smith', 25, Decimal('3000.00'))
(3, 'Alice Johnson', 28, Decimal('3000.00'))
(4, 'Bob Brown', 35, None)